src/cf/DataProcessors/ор_ПомощникЗаполненияОптовыхЗвеньев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ор_ПомощникЗаполненияОптовыхЗвеньев</Name>
			<Comment>Помощник заполнения оптовых звеньев</Comment>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВыборСтроки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиПоступления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ор_ДатаРеализации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ор_ЗакупкаУПроизводителя</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ор_ЦенаПроизводителя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОптовыеЗвенья</Name>
					<Comment>Оптовые звенья</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокЗвена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценки</Name>
							<Comment>Процент наценки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНаценки</Name>
							<Comment>Сумма наценки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УСНЕНВД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ор_ПомощникЗаполненияОптовыхЗвеньев/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ТЧОптовыеЗвенья = Параметры.ОптовыеЗвенья.Выгрузить();
	Объект.ОптовыеЗвенья.Загрузить(ТЧОптовыеЗвенья);
	
	Для Каждого ТекТовар Из Параметры.Товары Цикл
		Если ЗначениеЗаполнено(ТекТовар.Номенклатура)
				И ТекТовар.Номенклатура.ор_ЖНВЛС Тогда
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекТовар);
			НоваяСтрока.НомерСтрокиПоступления = ТекТовар.НомерСтроки;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекТовар Из Объект.Товары Цикл
		КоличествоЗвеньев = Объект.ОптовыеЗвенья.НайтиСтроки(Новый Структура("КлючСвязи", ТекТовар.КлючСвязи));
		Если КоличествоЗвеньев.Количество() > 0 Тогда
			ТекТовар.Обработан = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ТекТовар Из Объект.Товары Цикл
		ТекТовар.ВыборСтроки = Ложь;
	КонецЦикла;
	ТекущиеДанные.ВыборСтроки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОптовыеЗвеньяПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ОптовыеЗвенья.ТекущиеДанные;
	Если Не НоваяСтрока
		Или ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПорядокЗвена = ОпределитьНомерЗвена();
	ТекущиеДанные.КлючСвязи = ТекущийКлючСвязи;
	ТекущиеДанные.ПорядокЗвена = ПорядокЗвена;
	ТекущиеДанные.Номенклатура = Элементы.Товары.ТекущиеДанные.Номенклатура;
	ТекущиеДанные.Характеристика = Элементы.Товары.ТекущиеДанные.Характеристика;
	
КонецПроцедуры //ОптовыеЗвеньяПриНачалеРедактирования()

&НаКлиенте
Процедура ОптовыеЗвеньяПослеУдаления(Элемент)
	
	ПорядокЗвена = 1;
	Для Каждого ТекСтрока Из Объект.ОптовыеЗвенья Цикл
		Если ТекСтрока.КлючСвязи = ТекущийКлючСвязи Тогда
			ТекСтрока.ПорядокЗвена = ПорядокЗвена;
			ПорядокЗвена = ПорядокЗвена + 1;
		КонецЕсли;
	КонецЦикла;
	
	КоличествоЗвеньев = Объект.ОптовыеЗвенья.НайтиСтроки(Новый Структура("КлючСвязи", ТекущийКлючСвязи));
	Если КоличествоЗвеньев.Количество() = 0 Тогда
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("КлючСвязи", ТекущийКлючСвязи));
		НайденныеСтроки[0].Обработан = Ложь;
	КонецЕсли;
	
КонецПроцедуры //ОптовыеЗвеньяПослеУдаления()

#КонецОбласти

#Область ОбработчикиКомандФормы

// Переход к странице добавление, начальное заполнение оптовых звеньев
&НаКлиенте
Процедура ПерейтиКЗаполнениюЗВеньев()
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.КлючСвязи = ИнициализироватьТекущийКлючСвязи(ТекущиеДанные.КлючСвязи);
	
	ТекущийКлючСвязи = ТекущиеДанные.КлючСвязи;
	Элементы.ОптовыеЗвенья.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСвязи", ТекущийКлючСвязи);
	
	Номенклатура = ТекущиеДанные.Номенклатура;
	ХарактеристикаНоменклатура = ТекущиеДанные.Характеристика;
	ЦенаПроизводителя = ТекущиеДанные.ор_ЦенаПроизводителя;
	ДатаРеализации = ТекущиеДанные.ор_ДатаРеализации;
	ЗакупкаУПроизводителя = ТекущиеДанные.ор_ЗакупкаУПроизводителя;
	
	Элементы.СтраницаДобавления.Доступность = Истина;
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДобавления;
	Элементы.СтраницаВыбор.Доступность = Ложь;
	
КонецПроцедуры // ПерейтиКЗаполнениюЗВеньев()

// Процедура переноса данных в документ поступление
&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Товары", Объект.Товары);
	ПараметрыФормы.Вставить("ОптовыеЗвенья",Объект.ОптовыеЗвенья);
	Закрыть(ПараметрыФормы);
КонецПроцедуры // ПеренестиВДокумент()

// Процедура для перехода между страницами добавления звеньев и выбора ЖНВЛП
&НаКлиенте
Процедура ПродолжитьДобавление(Команда)
	
	НомерЗаполненнойСтроки =1;
	
	Если Элементы.СтраницаДобавления.Доступность = Ложь Тогда
		ПерейтиКЗаполнениюЗВеньев();
	Иначе
		Элементы.СтраницаДобавления.Доступность = Ложь;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыбор;
		Элементы.СтраницаВыбор.Доступность = Истина;
		
		Для Каждого ТекСтрока Из Объект.Товары Цикл
			Если ТекСтрока.ВыборСтроки = Истина Тогда
				ТекСтрока.ВыборСтроки = Ложь;
				НомерЗаполненнойСтроки = ТекСтрока.НомерСтроки;
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		Элементы.Товары.ТекущаяСтрока = НомерЗаполненнойСтроки;
		
	КонецЕсли;
	
КонецПроцедуры //ПродолжитьДобавление()

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	ТекущиеДанные = Элементы.ОптовыеЗвенья.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПереместитьВверхВнизНаСервере(ТекущиеДанные, "Вверх");
КонецПроцедуры //ПереместитьВверх()

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	ТекущиеДанные = Элементы.ОптовыеЗвенья.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПереместитьВверхВнизНаСервере(ТекущиеДанные, "Вниз");
КонецПроцедуры //ПереместитьВниз()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// функция для инициализации ключа связи
&НаКлиенте
Функция ИнициализироватьТекущийКлючСвязи(КлючСвязиСтроки)
	
	Если КлючСвязиСтроки = 0 Тогда
		
		Для Каждого ТекТовар Из Объект.Товары Цикл
			КлючСвязиСтроки = ?(КлючСвязиСтроки < ТекТовар.КлючСвязи, ТекТовар.КлючСвязи, КлючСвязиСтроки);
		КонецЦикла;
		
		НовыйКлючСвязи = КлючСвязиСтроки + 1; 
		Возврат НовыйКлючСвязи;
	Иначе
		Возврат КлючСвязиСтроки;
	КонецЕсли;
	
КонецФункции // ИнициализироватьТекущийКлючСвязи()

// функция определения порядкового номера звена
&НаКлиенте
Функция ОпределитьНомерЗвена()
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("КлючСвязи", ТекущийКлючСвязи);
	
	НайденныеСтроки = Объект.ОптовыеЗвенья.НайтиСтроки(СтруктураОтбора);
	
	ПорядокЗвена = 0;
	
	Для Каждого ТекСтрока Из НайденныеСтроки Цикл
		ПорядокЗвена = ?(ТекСтрока.ПорядокЗвена > ПорядокЗвена, ТекСтрока.ПорядокЗвена, ПорядокЗвена);
	КонецЦикла;
	
	ПорядокЗвена = ПорядокЗвена + 1;
	
	Возврат ПорядокЗвена;
	
КонецФункции //ОпределитьНомерЗвена()

// Процедура перемещения строк табличной части ОптовыеЗвенья
&НаКлиенте
Процедура ПереместитьВверхВнизНаСервере(ТекСтрока, Перемещение)
	
	Если ТекСтрока.ПорядокЗвена = 1 И Перемещение = "Вверх" Тогда
		Возврат;
	КонецЕсли;
	
	Если Перемещение = "Вниз" Тогда
		
		МаксимальноеЗвено = 1;
		Для Каждого ТекТовар Из Объект.ОптовыеЗвенья Цикл
			Если ТекТовар.ПорядокЗвена > МаксимальноеЗвено И ТекТовар.КлючСвязи = ТекущийКлючСвязи Тогда
				МаксимальноеЗвено = ТекТовар.ПорядокЗвена;
			КонецЕсли;
		КонецЦикла;
		
		Если ТекСтрока.ПорядокЗвена = МаксимальноеЗвено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Номер = ТекСтрока.НомерСтроки;
	
	СтрокаИсточник = Объект.ОптовыеЗвенья[Номер-1];
	
	Цена           = СтрокаИсточник.Цена;
	ПроцентНаценки = СтрокаИсточник.ПроцентНаценки;
	СуммаНаценки   = СтрокаИсточник.СуммаНаценки;
	Поставщик      = СтрокаИсточник.Поставщик;
	
	Если Перемещение = "Вверх" Тогда
		СтрокаПриемник = Объект.ОптовыеЗвенья[Номер - 2];
	Иначе
		СтрокаПриемник = Объект.ОптовыеЗвенья[Номер];
	КонецЕсли;
	
	СтрокаИсточник.Цена = СтрокаПриемник.Цена;
	СтрокаИсточник.ПроцентНаценки = СтрокаПриемник.ПроцентНаценки;
	СтрокаИсточник.СуммаНаценки = СтрокаПриемник.СуммаНаценки;
	СтрокаИсточник.Поставщик = СтрокаПриемник.Поставщик;
	
	СтрокаПриемник.Цена = Цена;
	СтрокаПриемник.ПроцентНаценки = ПроцентНаценки;
	СтрокаПриемник.СуммаНаценки = СуммаНаценки;
	СтрокаПриемник.Поставщик = Поставщик;
	
КонецПроцедуры //ПереместитьВверхВнизНаСервере()

&НаКлиенте
Процедура ОптовыеЗвеньяПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЗакупкаУПроизводителя Тогда
		ТекстСообщения = НСтр("ru='Установлен признак закупки у производителя. Добавлять оптовые звенья нельзя.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("КлючСвязи", ТекущийКлючСвязи));
	НайденныеСтроки[0].Обработан = Истина;
	
КонецПроцедуры

#КонецОбласти
